/*▄────────▄
  █        █
  █  Меню  █
  █        █
  ▀────────▀*/
// #┌────────────────────────────────────────────────┐
// #│ Предлагает пользователю выбрать пустой каталог │
// #└────────────────────────────────────────────────┘
//     'dir_error')
//     # Выводим меню на экран
//         menu "$HEADER" 1
//         #   Цвет      Строка
//             Green "1. Обновить (git clone '$GIT_URL/$GIT_USER/$GIT_REPO')"
//              Exit '0. Exit'

//     # Проходим по пунктам меню
//         case $? in
//             1) controller:Git 'gitclone' ;; # Выбран: "Обновить"
//             0)        nav:Exit           ;; # Выбран: "Exit"
//         esac
//     ;;

$.nav = class {
/*┌──────────────────────────────────────┐
  │ Предлагает пользователю выбрать файл │
  └──────────────────────────────────────┘*/
    'main'=f=>['Выберите команду:', 1, class {
    // Выводим меню на экран
        '1. http-server'
        '2. http-server + watch-dir'
        '3. Настройки'
        '0. Exit'
        
    // Проходим по пунктам меню
        1=f=>$.controller.Server()
        2=f=>$.controller.ServerAndWatchDir()
        3=f=>this.next('settings')
        0=f=>this.exit()
    }]
    
/*┌───────────┐
  │ Настройки │
  └───────────┘*/
    'settings'=f=>['Выберите команду:', 0, class {
    // Выводим меню на экран
        '1. SSH-Keygen  Перейти в раздел'
        '2. Uninstall   Перейти в раздел'
        '0. Назад'
        
    // Проходим по пунктам меню
        1=f=>$.controller.ssh()
        2=f=>$.controller.uninstall()
        0=f=>this.back()
    }]
};
